Revit 2027 API
ParameterTypeId.FabricationProductDataSizeDescription Property
 "Product Size Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataSizeDescription { get; }
Public Shared ReadOnly Property FabricationProductDataSizeDescription As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataSizeDescription {
	ForgeTypeId^ get ();
}
static member FabricationProductDataSizeDescription : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace